// 扭蛋奖品池 —— 把照片放进 images/ 文件夹，然后在这里配置
const gachaData = [
  {
    image: "images/photo1.jpg",
    text: "这是你加我vx的那天，你在路上碰到我，跟我说话的时候，我就很开心，这不是上学期跟我一节课的那个美女，但是你为什么不告诉我真名，臭宝宝。 💌",
    rarity: 3
  },
  {
    image: "images/photo2.jpg",
    text: "这是我们的第一张合照，略显有些羞涩，我记得我还淘气的说你这样说，我也不一定这样做。 💓",
    rarity: 2
  },
  {
    image: "images/photo3.jpg",
    text: "这是我陪你过的第一个生日，但我更想能陪你过接下来的每一个生日，甚至是每一天，我都希望能在你身边陪着你。 🌸",
    rarity: 3
  },
  {
    image: "images/photo4.jpg",
    text: "这是宝宝陪我过生日，简直我做梦都想有的一天，没想到在现实中实现了，我感觉我此生无憾了，开玩笑的宝宝，我也希望以后我的生日都有宝宝陪我，在遇到宝宝之前，我真的不想过生日，因为每次一到过生日，我就感觉自己很孤独，但宝宝的出现，让我知道了这个世界上除了跟我有血缘关系的亲人，还有一个人在爱着我，在乎我。 ✨",
    rarity: 2
  },
  {
    image: "images/photo5.jpg",
    text: "这是我们第一次期中周出去旅游，也是第一次跟这么多对情侣第一次旅游，我真的非常开心，宝宝我的拍照技术是不是进步了，以后可不许再侮辱我的拍照技术了，别忘了你发的照片可都是我拍的，哼哼。 🍀",
    rarity: 1
  },
  {
    image: "images/photo6.jpg",
    text: "这是我和宝宝一起去湖州的南浔古镇，虽然感觉景色不是很好看，但我和宝宝一起游船还是挺有意思的，只要跟宝宝待在一起，我感觉好想去哪都不是那么重要，当然不是说以后不出去玩了，而是说只要跟宝宝一起就非常开心哈哈哈，当然我可能出去玩早上还是想要健身，宝宝可不要骂我。 🎀",
    rarity: 1
  },
  {
    image: "images/photo7.jpg",
    text: " 我跟宝宝一起去了曼丽和dont jump，这是我第一学期唯一出去的海边哈哈哈，感谢宝宝又跟我一起去了其他的海边，不然我的悉尼生活可能只有篮球和健身了，you jump，i jump，臭宝宝，因为你的出现，我的生活中多了更多的色彩和体验。 💗",
    rarity: 2
  },
  {
    image: "images/photo8.jpg",
    text: "和宝宝一起参加了我队友的婚礼，这是我第一次和我最爱的人一起参加婚礼，真的有种不一样的体验，我总感觉有一天我也会和宝宝一起站在前面，一定会的，面对着这么多人，我突然感觉一阵压力涌上心头，但更多的是开心和期待，希望这一天不会等太久，我相信那一天的我一定是这个世界上最幸福的人，因为我的宝宝是天下无双，最好的宝宝。 👀",
    rarity: 3
  }
];
